nakhonthai/ESP32IGate/src/main.cpp
/*
 Name:		ESP32 APRS Internet Gateway
 Created:	1-Nov-2021 14:27:23
 Author:	HS5TQA/Atten
 Support IS: host:aprs.dprns.com port:14580
 Support IS monitor: http://aprs.dprns.com:14501
 Support in LINE Group APRS Only
*/

#include <Arduino.h>
#include "main.h"
#include <LibAPRSesp.h>
#include <limits.h>
#include <KISS.h>
#include "webservice.h"
#include <WiFiUdp.h>
#include "ESP32Ping.h"
#include <WiFi.h>
#include <WiFiMulti.h>
#include <WiFiClient.h>
#include "cppQueue.h"
#include "digirepeater.h"
#include "igate.h"
#include "wireguardif.h"
#include "wireguard.h"

#include <TinyGPS++.h>
#include <pbuf.h>
#include <parse_aprs.h>
#include <Fonts/FreeSansBold9pt7b.h>
#include <Fonts/FreeSerifItalic9pt7b.h>
#include <Fonts/Seven_Segment24pt7b.h>

#include "wireguard_vpn.h"
#include <WiFiUdp.h>

#include <WiFiClientSecure.h>

#include "AFSK.h"

// #include <PPPoS.h>

#define EEPROM_SIZE 2048

#ifdef BLUETOOTH
#include "BluetoothSerial.h"
#endif

#ifdef OLED
#include <Wire.h>
#include "Adafruit_SSD1306.h"
#include <Adafruit_GFX.h>
#include <Adafruit_I2CDevice.h>

#define SCREEN_WIDTH 128 // OLED display width, in pixels
#define SCREEN_HEIGHT 64 // OLED display height, in pixels
// Declaration for an SSD1306 display connected to I2C (SDA, SCL pins)
#define OLED_RESET 4        // Reset pin # (or -1 if sharing Arduino reset pin)
#define SCREEN_ADDRESS 0x3D ///< See datasheet for Address; 0x3D for 128x64, 0x3C for 128x32
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, -1);

#endif

struct pbuf_t aprs;
ParseAPRS aprsParse;

TinyGPSPlus gps;

#define VBAT_PIN 35
// #define WIRE 4
//  #define POWER_PIN 12
//  #define PULLDOWN_PIN 27
//  #define SQL_PIN 33

// #define MODEM_PWRKEY 5
// #define MODEM_TX 17
// #define MODEM_RX 16

#define LED_TX 4
#define LED_RX 2

#define PPP_APN "internet"
#define PPP_USER ""
#define PPP_PASS ""

const char *str_status[] = {
    "IDLE_STATUS",
    "NO_SSID_AVAIL",
    "SCAN_COMPLETED",
    "CONNECTED",
    "CONNECT_FAILED",
    "CONNECTION_LOST",
    "DISCONNECTED"};

// PPPoS ppp;

time_t systemUptime = 0;
time_t wifiUptime = 0;

boolean KISS = false;
bool aprsUpdate = false;

boolean gotPacket = false;
AX25Msg incomingPacket;

bool lastPkg = false;
bool afskSync = false;
String lastPkgRaw = "";
float dBV = 0;
int mVrms = 0;

long timeNetwork, timeAprs, timeGui;

cppQueue PacketBuffer(sizeof(AX25Msg), 5, IMPLEMENTATION); // Instantiate queue
#ifdef OLED
cppQueue dispBuffer(300, 5, IMPLEMENTATION);
#endif
cppQueue queTxDisp(sizeof(txDisp), 10, IMPLEMENTATION); // Instantiate queue

void pushTxDisp(uint8_t ch, const char *name, char *info)
{
    if (!config.tx_display)
        return;

    txDisp pkg;

    pkg.tx_ch = ch;
    strcpy(pkg.name, name);
    strcpy(pkg.info, info);
    queTxDisp.push(&pkg); // ใส่แพ็จเก็จจาก TNC ลงคิวบัพเฟอร์
}

statusType status;
RTC_DATA_ATTR igateTLMType igateTLM;
txQueueType *txQueue;
// #ifdef BOARD_HAS_PSRAM
// txQueueType *txQueue;
// #else
// RTC_DATA_ATTR txQueueType txQueue[PKGTXSIZE];
// #endif

extern RTC_DATA_ATTR uint8_t digiCount;

String RF_VERSION;

Configuration config;

pkgListType *pkgList;

TelemetryType *Telemetry;

TaskHandle_t taskNetworkHandle;
TaskHandle_t taskAPRSHandle;
TaskHandle_t taskGpsHandle;

HardwareSerial SerialRF(1);
HardwareSerial SerialGPS(2);
// HardwareSerial SerialTNC(2);

bool firstGpsTime = true;
time_t startTime = 0;

#ifdef BLUETOOTH
BluetoothSerial SerialBT;

void Bluetooth()
{
    if (SerialBT.available())
    {
        char raw[500];
        int i = 0;
        memset(raw, 0, sizeof(raw));
        i = SerialBT.readBytes((uint8_t *)&raw, 500);

        if (config.bt_mode == 1)
        { // TNC2RAW MODE
            pkgTxPush(raw, strlen(raw), 1);
        }
        else if (config.bt_mode == 2)
        {
            // KISS MODE
            for (int n = 0; n < i; n++)
                kiss_serial((uint8_t)raw[n]);
        }
    }
}
#endif

WeatherData weather;

// Set your Static IP address for wifi AP
IPAddress local_IP(192, 168, 4, 1);
IPAddress gateway(192, 168, 4, 254);
IPAddress subnet(255, 255, 255, 0);

IPAddress vpn_IP(192, 168, 44, 195);

int pkgTNC_count = 0;

time_t setGpsTime()
{
    time_t time;
    tmElements_t timeinfo;
    if (gps.time.isValid())
    {
        timeinfo.Year = (gps.date.year()) - 1970;
        timeinfo.Month = gps.date.month();
        timeinfo.Day = gps.date.day();
        timeinfo.Hour = gps.time.hour();
        timeinfo.Minute = gps.time.minute();
        timeinfo.Second = gps.time.second();
        time_t timeStamp = makeTime(timeinfo);
        time = timeStamp + config.timeZone * SECS_PER_HOUR;
        setTime(time);
        // setTime(timeinfo.Hour,timeinfo.Minute,timeinfo.Second,timeinfo.Day, timeinfo.Month, timeinfo.Year);
        return time;
    }
    return 0;
}

time_t getGpsTime()
{
    time_t time;
    tmElements_t timeinfo;
    if (gps.time.isValid())
    {
        timeinfo.Year = (gps.date.year()) - 1970;
        timeinfo.Month = gps.date.month();
        timeinfo.Day = gps.date.day();
        timeinfo.Hour = gps.time.hour();
        timeinfo.Minute = gps.time.minute();
        timeinfo.Second = gps.time.second();
        time_t timeStamp = makeTime(timeinfo);
        time = timeStamp + config.timeZone * SECS_PER_HOUR;
        return time;
    }
    return 0;
}

String getValue(String data, char separator, int index)
{
    int found = 0;
    int strIndex[] = {0, -1};
    int maxIndex = data.length();

    for (int i = 0; i <= maxIndex && found <= index; i++)
    {
        if (data.charAt(i) == separator || i == maxIndex)
        {
            found++;
            strIndex[0] = strIndex[1] + 1;
            strIndex[1] = (i == maxIndex) ? i + 1 : i;
        }
    }
    return found > index ? data.substring(strIndex[0], strIndex[1]) : "";
} // END

boolean isValidNumber(String str)
{
    for (byte i = 0; i < str.length(); i++)
    {
        if (isDigit(str.charAt(i)))
            return true;
    }
    return false;
}

uint8_t checkSum(uint8_t *ptr, size_t count)
{
    uint8_t lrc, tmp;
    uint16_t i;
    lrc = 0;
    for (i = 0; i < count; i++)
    {
        tmp = *ptr++;
        lrc = lrc ^ tmp;
    }
    return lrc;
}

void saveEEPROM()
{
    uint8_t chkSum = 0;
    byte *ptr;
    ptr = (byte *)&config;
    EEPROM.writeBytes(1, ptr, sizeof(Configuration));
    chkSum = checkSum(ptr, sizeof(Configuration));
    EEPROM.write(0, chkSum);
    EEPROM.commit();
#ifdef DEBUG
    Serial.print("Save EEPROM ChkSUM=");
    Serial.println(chkSum, HEX);
#endif
}

void defaultConfig()
{
    log_d("Default configure mode!");
    config.synctime = true;
    config.timeZone = 7;
    config.tx_timeslot = 2000; // ms

    config.wifi_mode = WIFI_AP_STA_FIX;
    config.wifi_power = 44;
    config.wifi_ap_ch = 6;
    config.wifi_sta[0].enable = true;
    sprintf(config.wifi_sta[0].wifi_ssid, "APRSTH");
    sprintf(config.wifi_sta[0].wifi_pass, "aprsthnetwork");
    for (int i = 1; i < 5; i++)
    {
        config.wifi_sta[i].enable = false;
        config.wifi_sta[i].wifi_ssid[0] = 0;
        config.wifi_sta[i].wifi_pass[0] = 0;
    }
    sprintf(config.wifi_ap_ssid, "ESP32IGate");
    sprintf(config.wifi_ap_pass, "aprsthnetwork");
    // Blutooth
    config.bt_slave = false;
    config.bt_master = false;
    config.bt_mode = 1; // 0-None,1-TNC2RAW,2-KISS
    config.bt_power = 1;
    sprintf(config.bt_uuid, "6E400001-B5A3-F393-E0A9-E50E24DCCA9E");
    sprintf(config.bt_uuid_rx, "6E400002-B5A3-F393-E0A9-E50E24DCCA9E");
    sprintf(config.bt_uuid_tx, "6E400003-B5A3-F393-E0A9-E50E24DCCA9E");
    sprintf(config.bt_name, "ESP32APRS");
    config.bt_pin = 0;

