nakhonthai/ESP32IGate/src/main.cpp
    //--RF Module
    config.rf_en = false;
    config.rf_type = RF_SA868_VHF;
    config.freq_rx = 144.3900;
    config.freq_tx = 144.3900;
    config.offset_rx = 0;
    config.offset_tx = 0;
    config.tone_rx = 0;
    config.tone_tx = 0;
    config.band = 0;
    config.sql_level = 1;
    config.rf_power = LOW;
    config.volume = 6;
    config.mic = 8;

    // IGATE
    config.igate_bcn = false;
    config.igate_en = false;
    config.rf2inet = true;
    config.inet2rf = false;
    config.igate_loc2rf = false;
    config.igate_loc2inet = true;
    config.rf2inetFilter = 0xFFF; // All
    config.inet2rfFilter = config.digiFilter = FILTER_OBJECT | FILTER_ITEM | FILTER_MESSAGE | FILTER_MICE | FILTER_POSITION | FILTER_WX;
    //--APRS-IS
    config.aprs_ssid = 1;
    config.aprs_port = 14580;
    sprintf(config.aprs_mycall, "NOCALL");
    sprintf(config.aprs_host, "aprs.dprns.com");
    memset(config.aprs_passcode, 0, sizeof(config.aprs_passcode));
    sprintf(config.aprs_moniCall, "%s-%d", config.aprs_mycall, config.aprs_ssid);
    sprintf(config.aprs_filter, "m/10");
    //--Position
    config.igate_gps = false;
    config.igate_lat = 13.7555;
    config.igate_lon = 100.4930;
    config.igate_alt = 0;
    config.igate_interval = 600;
    sprintf(config.igate_symbol, "/&");
    memset(config.igate_object, 0, sizeof(config.igate_object));
    memset(config.igate_phg, 0, sizeof(config.igate_phg));
    sprintf(config.igate_path, "WIDE1-1");
    sprintf(config.igate_comment, "IGate MODE");

    // DIGI REPEATER
    config.digi_en = false;
    config.digi_loc2rf = true;
    config.digi_loc2inet = false;
    config.digi_ssid = 3;
    config.digi_timestamp = false;
    sprintf(config.digi_mycall, "NOCALL");
    sprintf(config.digi_path, "WIDE1-1");
    //--Position
    config.digi_gps = false;
    config.digi_lat = 13.7555;
    config.digi_lon = 100.4930;
    config.digi_alt = 0;
    config.digi_interval = 600;
    config.igate_timestamp = false;
    config.digi_delay = 0;
    config.digiFilter = FILTER_OBJECT | FILTER_ITEM | FILTER_MESSAGE | FILTER_MICE | FILTER_POSITION | FILTER_WX;

    sprintf(config.digi_symbol, "/#");
    memset(config.digi_phg, 0, sizeof(config.digi_phg));
    sprintf(config.digi_comment, "DIGI MODE");

    // WX
    config.wx_en = false;
    config.wx_2rf = true;
    config.wx_2inet = true;
    config.wx_ssid = 13;
    sprintf(config.wx_mycall, "NOCALL");
    sprintf(config.wx_path, "WIDE1-1");
    sprintf(config.wx_comment, "WX MODE");
    memset(config.wx_object, 0, sizeof(config.wx_object));

    //--Position
    config.wx_gps = false;
    config.wx_lat = 13.7555;
    config.wx_lon = 100.4930;
    config.wx_alt = 0;
    config.wx_interval = 600;
    config.wx_mode = 0;

    // OLED DISPLAY
    config.oled_enable = true;
    config.oled_timeout = 60;
    config.dim = 0;
    config.contrast = 0;
    config.startup = 0;

    // Display
    config.dispDelay = 3; // Popup display 3 sec
    config.dispRF = true;
    config.dispINET = false;
    config.filterDistant = 0;
    config.dispFilter = 0xFFFF; // All filter
    config.h_up = false;
    config.tx_display = true;
    config.rx_display = true;
    config.audio_hpf = false;
    config.audio_bpf = false;
    config.preamble = 3;
    sprintf(config.ntp_host, "ntp.dprns.com");

    sprintf(config.path[0], "WIDE1-1");
    sprintf(config.path[1], "WIDE1-1,WIDE2-1");
    sprintf(config.path[2], "TRACK3-3");
    sprintf(config.path[3], "RS0ISS");

    // VPN Wireguard
    config.vpn = false;
    config.wg_port = 51820;
    sprintf(config.wg_peer_address, "vpn.dprns.com");
    sprintf(config.wg_local_address, "192.168.1.2");
    sprintf(config.wg_netmask_address, "255.255.255.0");
    sprintf(config.wg_gw_address, "192.168.1.1");
    sprintf(config.wg_public_key, "");
    sprintf(config.wg_private_key, "");

    sprintf(config.http_username, "admin");
    sprintf(config.http_password, "admin");

    config.gnss_baudrate = 9600;
    config.gnss_enable = false;
    config.gnss_tx_gpio = 19;
    config.gnss_rx_gpio = 18;
    config.gnss_pps_gpio = -1;

    config.modbus_baudrate = 9600;
    config.modbus_enable = false;
    config.modbus_tx_gpio = 17;
    config.modbus_rx_gpio = 16;

    config.rf_baudrate = 9600;
    config.rf_tx_gpio = 13;
    config.rf_rx_gpio = 14;
    config.rf_sql_gpio = 33;
    config.rf_pd_gpio = 27;
    config.rf_pwr_gpio = 12;
    config.rf_ptt_gpio = 32;
    config.rf_sql_active = 0;
    config.rf_pd_active = 1;
    config.rf_pwr_active = 0;
    config.rf_ptt_active = 1;

    saveEEPROM();
}

unsigned long NTP_Timeout;
unsigned long pingTimeout;

bool psramBusy = false;

const char *lastTitle = "LAST HEARD";

int tlmList_Find(char *call)
{
    int i;
    for (i = 0; i < TLMLISTSIZE; i++)
    {
        if (strstr(Telemetry[i].callsign, call) != NULL)
            return i;
    }
    return -1;
}

int tlmListOld()
{
    int i, ret = 0;
    time_t minimum = Telemetry[0].time;
    for (i = 1; i < TLMLISTSIZE; i++)
    {
        if (Telemetry[i].time < minimum)
        {
            minimum = Telemetry[i].time;
            ret = i;
        }
        if (Telemetry[i].time > now())
            Telemetry[i].time = 0;
    }
    return ret;
}

int pkgList_Find(char *call)
{
    int i;
    for (i = 0; i < PKGLISTSIZE; i++)
    {
        if (strstr(pkgList[(int)i].calsign, call) != NULL)
            return i;
    }
    return -1;
}

int pkgList_Find(char *call, uint16_t type)
{
    int i;
    for (i = 0; i < PKGLISTSIZE; i++)
    {
        if ((strstr(pkgList[i].calsign, call) != NULL) && (pkgList[i].type == type))
            return i;
    }
    return -1;
}

int pkgListOld()
{
    int i, ret = -1;
    time_t minimum = time(NULL) + 86400; // pkgList[0].time;
    for (i = 0; i < PKGLISTSIZE; i++)
    {
        if (pkgList[(int)i].time < minimum)
        {
            minimum = pkgList[(int)i].time;
            ret = i;
        }
    }
    return ret;
}

void sort(pkgListType a[], int size)
{
    pkgListType t;
    char *ptr1;
    char *ptr2;
    char *ptr3;
    ptr1 = (char *)&t;
#ifdef BOARD_HAS_PSRAM
    while (psramBusy)
        delay(1);
    psramBusy = true;
#endif
    for (int i = 0; i < (size - 1); i++)
    {
        for (int o = 0; o < (size - (i + 1)); o++)
        {
            if (a[o].time < a[o + 1].time)
            {
                ptr2 = (char *)&a[o];
                ptr3 = (char *)&a[o + 1];
                memcpy(ptr1, ptr2, sizeof(pkgListType));
                memcpy(ptr2, ptr3, sizeof(pkgListType));
                memcpy(ptr3, ptr1, sizeof(pkgListType));
            }
        }
    }
    psramBusy = false;
}

