nakhonthai/ESP32IGate/src/main.cpp
void sortPkgDesc(pkgListType a[], int size)
{
    pkgListType t;
    char *ptr1;
    char *ptr2;
    char *ptr3;
    ptr1 = (char *)&t;
#ifdef BOARD_HAS_PSRAM
    while (psramBusy)
        delay(1);
    psramBusy = true;
#endif
    for (int i = 0; i < (size - 1); i++)
    {
        for (int o = 0; o < (size - (i + 1)); o++)
        {
            if (a[o].pkg < a[o + 1].pkg)
            {
                ptr2 = (char *)&a[o];
                ptr3 = (char *)&a[o + 1];
                memcpy(ptr1, ptr2, sizeof(pkgListType));
                memcpy(ptr2, ptr3, sizeof(pkgListType));
                memcpy(ptr3, ptr1, sizeof(pkgListType));
            }
        }
    }
    psramBusy = false;
}

uint16_t pkgType(const char *raw)
{
    uint16_t type = 0;
    char packettype = 0;
    const char *info_start, *body;
    int paclen = strlen(raw);
    char *ptr;

    if (*raw == 0)
        return 0;

    packettype = (char)raw[0];
    body = &raw[1];

    switch (packettype)
    {
    case '$': // NMEA
        type |= FILTER_POSITION;
        break;
    case 0x27: /* ' */
    case 0x60: /* ` */
        type |= FILTER_POSITION;
        type |= FILTER_MICE;
        break;
    case '!':
    case '=':
        type |= FILTER_POSITION;
        if (body[18] == '_' || body[10] == '_')
        {
            type |= FILTER_WX;
            break;
        }
    case '/':
    case '@':
        type |= FILTER_POSITION;
        if (body[25] == '_' || body[16] == '_')
        {
            type |= FILTER_WX;
            break;
        }
        if (strchr(body, 'r') != NULL)
        {
            if (strchr(body, 'g') != NULL)
            {
                if (strchr(body, 't') != NULL)
                {
                    if (strchr(body, 'P') != NULL)
                    {
                        type |= FILTER_WX;
                    }
                }
            }
        }
        break;
    case ':':
        if (body[9] == ':' &&
            (memcmp(body + 10, "PARM", 4) == 0 ||
             memcmp(body + 10, "UNIT", 4) == 0 ||
             memcmp(body + 10, "EQNS", 4) == 0 ||
             memcmp(body + 10, "BITS", 4) == 0))
        {
            type |= FILTER_TELEMETRY;
        }
        else
        {
            type |= FILTER_MESSAGE;
        }
        break;
    case '{': // User defind
    case '<': // statcapa
    case '>':
        type |= FILTER_STATUS;
        break;
    case '?':
        type |= FILTER_QUERY;
        break;
    case ';':
        if (body[28] == '_')
            type |= FILTER_WX;
        else
            type |= FILTER_OBJECT;
        break;
    case ')':
        type |= FILTER_ITEM;
        break;
    case '}':
        type |= FILTER_THIRDPARTY;
        ptr = strchr(raw, ':');
        if (ptr != NULL)
        {
            ptr++;
            type |= pkgType(ptr);
        }
        break;
    case 'T':
        type |= FILTER_TELEMETRY;
        break;
    case '#': /* Peet Bros U-II Weather Station */
    case '*': /* Peet Bros U-I  Weather Station */
    case '_': /* Weather report without position */
        type |= FILTER_WX;
        break;
    default:
        type = 0;
        break;
    }
    return type;
}

// uint16_t TNC2Raw[PKGLISTSIZE];
// int raw_count = 0, raw_idx_rd = 0, raw_idx_rw = 0;

// int pushTNC2Raw(int raw)
// {
//   if (raw < 0)
//     return -1;
//   if (raw_count > PKGLISTSIZE)
//     return -1;
//   if (++raw_idx_rw >= PKGLISTSIZE)
//     raw_idx_rw = 0;
//   TNC2Raw[raw_idx_rw] = raw;
//   raw_count++;
//   return raw_count;
// }

// int popTNC2Raw(int &ret)
// {
//   String raw = "";
//   int idx = 0;
//   if (raw_count <= 0)
//     return -1;
//   if (++raw_idx_rd >= PKGLISTSIZE)
//     raw_idx_rd = 0;
//   idx = TNC2Raw[raw_idx_rd];
//   if (idx < PKGLISTSIZE)
//     ret = idx;
//   if (raw_count > 0)
//     raw_count--;
//   return raw_count;
// }

pkgListType getPkgList(int idx)
{
    pkgListType ret;
#ifdef BOARD_HAS_PSRAM
    while (psramBusy)
        delay(1);
    psramBusy = true;
#endif
    memset(&ret, 0, sizeof(pkgListType));
    if (idx < PKGLISTSIZE)
        memcpy(&ret, &pkgList[idx], sizeof(pkgListType));
    psramBusy = false;
    return ret;
}

int pkgListUpdate(char *call, char *raw, uint16_t type, bool channel)
{
    size_t len;
    if (*call == 0)
        return -1;
    if (*raw == 0)
        return -1;

    char callsign[11];
    size_t sz = strlen(call);
    memset(callsign, 0, 11);
    if (sz > 10)
        sz = 10;
    // strncpy(callsign, call, sz);
    memcpy(callsign, call, sz);
#ifdef BOARD_HAS_PSRAM
    while (psramBusy)
        delay(1);
    psramBusy = true;
#endif
    int i = pkgList_Find(callsign, type);
    if (i > PKGLISTSIZE)
    {
        psramBusy = false;
        return -1;
    }
    if (i > -1)
    { // Found call in old pkg
        if ((channel == 1) || (channel == pkgList[i].channel))
        {
            pkgList[i].time = time(NULL);
            pkgList[i].pkg++;
            pkgList[i].type = type;
            if (channel == 0)
                pkgList[i].audio_level = (int16_t)mVrms;
            else
                pkgList[i].audio_level = 0;
            len = strlen(raw);
            if (len > 500)
                len = 500;
            memcpy(pkgList[i].raw, raw, len);
            // SerialLOG.print("Update: ");
        }
    }
    else
    {
        i = pkgListOld(); // Search free in array
        if (i > PKGLISTSIZE || i < 0)
        {
            psramBusy = false;
            return -1;
        }
        // memset(&pkgList[i], 0, sizeof(pkgListType));
        pkgList[i].channel = channel;
        pkgList[i].time = time(NULL);
        pkgList[i].pkg = 1;
        pkgList[i].type = type;
        if (channel == 0)
            pkgList[i].audio_level = (int16_t)mVrms;
        else
            pkgList[i].audio_level = 0;
        // strcpy(pkgList[i].calsign, callsign);
        memcpy(pkgList[i].calsign, callsign, strlen(callsign));
        len = strlen(raw);
        if (len > 500)
            len = 500;
        memcpy(pkgList[i].raw, raw, len);
        // strcpy(pkgList[i].raw, raw);
        pkgList[i].calsign[10] = 0;
        // SerialLOG.print("NEW: ");
    }
    psramBusy = false;
    return i;
}

