nakhonthai/ESP32IGate/src/main.cpp
bool pkgTxDuplicate(AX25Msg ax25)
{
#ifdef BOARD_HAS_PSRAM
    while (psramBusy)
        delay(1);
    psramBusy = true;
#endif
    char callsign[12];
    for (int i = 0; i < PKGTXSIZE; i++)
    {
        if (txQueue[i].Active)
        {
            if (ax25.src.ssid > 0)
                sprintf(callsign, "%s-%d", ax25.src.call, ax25.src.ssid);
            else
                sprintf(callsign, "%s", ax25.src.call);
            if (strncmp(&txQueue[i].Info[0], callsign, strlen(callsign)) >= 0) // Check duplicate src callsign
            {
                char *ecs1 = strstr(txQueue[i].Info, ":");
                if (ecs1 == NULL)
                    continue;
                ;
                if (strncmp(ecs1, (const char *)ax25.info, strlen(ecs1)) >= 0)
                { // Check duplicate aprs info
                    txQueue[i].Active = false;
                    psramBusy = false;
                    return true;
                }
            }
        }
    }

    psramBusy = false;
    return false;
}

bool pkgTxPush(const char *info, size_t len, int dly)
{
    char *ecs = strstr(info, ">");
    if (ecs == NULL)
        return false;
#ifdef BOARD_HAS_PSRAM
    while (psramBusy)
        delay(1);
    psramBusy = true;
#endif
    // for (int i = 0; i < PKGTXSIZE; i++)
    // {
    //   if (txQueue[i].Active)
    //   {
    //     if ((strncmp(&txQueue[i].Info[0], info, info - ecs)==0)) //Check src callsign
    //     {
    //       // strcpy(&txQueue[i].Info[0], info);
    //       memset(txQueue[i].Info, 0, sizeof(txQueue[i].Info));
    //       memcpy(&txQueue[i].Info[0], info, len);
    //       txQueue[i].Delay = dly;
    //       txQueue[i].timeStamp = millis();
    //       psramBusy = false;
    //       return true;
    //     }
    //   }
    // }

    // Add
    for (int i = 0; i < PKGTXSIZE; i++)
    {
        if (txQueue[i].Active == false)
        {
            memset(txQueue[i].Info, 0, sizeof(txQueue[i].Info));
            memcpy(&txQueue[i].Info[0], info, len);
            txQueue[i].Delay = dly;
            txQueue[i].Active = true;
            txQueue[i].timeStamp = millis();
            break;
        }
    }
    psramBusy = false;
    return true;
}

bool pkgTxSend()
{
//   if (getReceive())
//     return false;
#ifdef BOARD_HAS_PSRAM
    while (psramBusy)
        delay(1);
    psramBusy = true;
#endif
    char info[500];
    for (int i = 0; i < PKGTXSIZE; i++)
    {
        if (txQueue[i].Active)
        {
            int decTime = millis() - txQueue[i].timeStamp;
            if (decTime > txQueue[i].Delay)
            {
                txQueue[i].Active = false;
                memset(info, 0, sizeof(info));
                strcpy(info, txQueue[i].Info);
                psramBusy = false;
                digitalWrite(config.rf_pwr_gpio, config.rf_power); // RF Power
                status.txCount++;

                APRS_setPreamble(config.preamble * 100);
                APRS_sendTNC2Pkt(String(info)); // Send packet to RF
                txQueue[i].Active = false;
                igateTLM.TX++;
                log_d("TX->RF: %s\n", info);

                for (int i = 0; i < 100; i++)
                {
                    if (digitalRead(config.rf_ptt_gpio) ^ config.rf_ptt_active)
                        break;
                    delay(50); // TOT 5sec
                }

                digitalWrite(config.rf_pwr_gpio, 0); // set RF Power Low
                return true;
            }
        }
    }
    psramBusy = false;
    return false;
}

uint8_t *packetData;
// ฟังชั่นถูกเรียกมาจาก ax25_decode
void aprs_msg_callback(struct AX25Msg *msg)
{
    AX25Msg pkg;

    memcpy(&pkg, msg, sizeof(AX25Msg));
    PacketBuffer.push(&pkg); // ใส่แพ็จเก็จจาก TNC ลงคิวบัพเฟอร์
    status.rxCount++;
}

void printTime()
{
    struct tm tmstruct;
    getLocalTime(&tmstruct, 5000);
    Serial.print("[");
    Serial.print(tmstruct.tm_hour);
    Serial.print(":");
    Serial.print(tmstruct.tm_min);
    Serial.print(":");
    Serial.print(tmstruct.tm_sec);
    Serial.print("]");
}

uint8_t gwRaw[PKGLISTSIZE][66];
uint8_t gwRawSize[PKGLISTSIZE];
int gwRaw_count = 0, gwRaw_idx_rd = 0, gwRaw_idx_rw = 0;

void pushGwRaw(uint8_t *raw, uint8_t size)
{
    if (gwRaw_count > PKGLISTSIZE)
        return;
    if (++gwRaw_idx_rw >= PKGLISTSIZE)
        gwRaw_idx_rw = 0;
    if (size > 65)
        size = 65;
    memcpy(&gwRaw[gwRaw_idx_rw][0], raw, size);
    gwRawSize[gwRaw_idx_rw] = size;
    gwRaw_count++;
}

uint8_t popGwRaw(uint8_t *raw)
{
    uint8_t size = 0;
    if (gwRaw_count <= 0)
        return 0;
    if (++gwRaw_idx_rd >= PKGLISTSIZE)
        gwRaw_idx_rd = 0;
    size = gwRawSize[gwRaw_idx_rd];
    memcpy(raw, &gwRaw[gwRaw_idx_rd][0], size);
    if (gwRaw_count > 0)
        gwRaw_count--;
    return size;
}

bool SA868_waitResponse(String &data, String rsp, uint32_t timeout)
{
    uint32_t startMillis = millis();
    data.clear();
    do
    {
        while (SerialRF.available() > 0)
        {
            int8_t ch = SerialRF.read();
            data += static_cast<char>(ch);
            if (rsp.length() && data.endsWith(rsp))
            {
                return true;
            }
        }
    } while (millis() - startMillis < timeout);
    return false;
}

int SA868_getRSSI()
{
    String data;
    int rssi;

    // Serial.printf("AT+RSSI?\r\n");
    SerialRF.printf("AT+RSSI?\r\n");
    if (SA868_waitResponse(data, "\r\n", 1000))
    {
        // Serial.println(INFO + data);
        String rssi = data.substring(data.indexOf("RSSI=") + strlen("RSSI="), data.indexOf("\r\n"));
        rssi = rssi.toInt();
        return rssi.toInt();
    }
    else
    {
        // timeout or error
        return 0;
    }
}

String SA868_getVERSION()
{
    String data;
    int rssi;

    SerialRF.printf("AT+VERSION\r\n");
    if (SA868_waitResponse(data, "\r\n", 1000))
    {
        String version = data.substring(0, data.indexOf("\r\n"));
        return version;
    }
    else
    {
        // timeout or error
        return "-";
    }
}

