nakhonthai/ESP32IGate/src/main.cpp
boolean APRSConnect()
{
    // Serial.println("Connect TCP Server");
    String login = "";
    int cnt = 0;
    uint8_t con = aprsClient.connected();
    // Serial.println(con);
    if (con <= 0)
    {
        if (!aprsClient.connect(config.aprs_host, config.aprs_port)) // เชื่อมต่อกับเซิร์ฟเวอร์ TCP
        {
            // Serial.print(".");
            delay(100);
            cnt++;
            if (cnt > 50) // วนร้องขอการเชื่อมต่อ 50 ครั้ง ถ้าไม่ได้ให้รีเทิร์นฟังค์ชั่นเป็น False
                return false;
        }
        // ขอเชื่อมต่อกับ aprsc
        if (strlen(config.igate_object) >= 3)
        {
            uint16_t passcode = aprsParse.passCode(config.igate_object);
            login = "user " + String(config.igate_object) + " pass " + String(passcode, DEC) + " vers ESP32IGate V" + String(VERSION) + String(VERSION_BUILD) + " filter " + String(config.aprs_filter);
        }
        else
        {
            uint16_t passcode = aprsParse.passCode(config.aprs_mycall);
            if (config.aprs_ssid == 0)
                login = "user " + String(config.aprs_mycall) + " pass " + String(passcode, DEC) + " vers ESP32IGate V" + String(VERSION) + String(VERSION_BUILD) + " filter " + String(config.aprs_filter);
            else
                login = "user " + String(config.aprs_mycall) + "-" + String(config.aprs_ssid) + " pass " + String(passcode, DEC) + " vers ESP32IGate V" + String(VERSION) + String(VERSION_BUILD) + " filter " + String(config.aprs_filter);
        }
        aprsClient.println(login);
        // Serial.println(login);
        // Serial.println("Success");
        delay(500);
    }
    return true;
}

long oledSleepTimeout = 0;
bool showDisp = false;
uint8_t curTab = 0;

void setup()
{
    byte *ptr;
#ifdef BOARD_HAS_PSRAM
    pkgList = (pkgListType *)ps_malloc(sizeof(pkgListType) * PKGLISTSIZE);
    Telemetry = (TelemetryType *)malloc(sizeof(TelemetryType) * TLMLISTSIZE);
    txQueue = (txQueueType *)ps_malloc(sizeof(txQueueType) * PKGTXSIZE);
    // TNC2Raw = (int *)ps_malloc(sizeof(int) * PKGTXSIZE);
#else
    pkgList = (pkgListType *)malloc(sizeof(pkgListType) * PKGLISTSIZE);
    Telemetry = (TelemetryType *)malloc(sizeof(TelemetryType) * TLMLISTSIZE);
    txQueue = (txQueueType *)malloc(sizeof(txQueueType) * PKGTXSIZE);
    // TNC2Raw = (int *)malloc(sizeof(int) * PKGTXSIZE);
#endif

    memset(pkgList, 0, sizeof(pkgListType) * PKGLISTSIZE);
    memset(Telemetry, 0, sizeof(TelemetryType) * TLMLISTSIZE);
    memset(txQueue, 0, sizeof(txQueueType) * PKGTXSIZE);

    pinMode(0, INPUT_PULLUP); // BOOT Button
    pinMode(LED_RX, OUTPUT);
    pinMode(LED_TX, OUTPUT);

    // Set up serial port
#ifdef CORE_DEBUG_LEVEL
    Serial.begin(921600); // debug
#else
    Serial.begin(9600); // monitor
#endif
    // Serial.setRxBufferSize(256);
    //  SerialTNC.begin(9600, SERIAL_8N1, 16, 17);
    //  SerialTNC.setRxBufferSize(500);

    Serial.println();
    Serial.println("Start ESP32IGate V" + String(VERSION));
    Serial.println("Push BOOT after 3 sec for Factory Default config.");

#ifdef OLED
    Wire.begin();
    Wire.setClock(400000L);

    // by default, we'll generate the high voltage from the 3.3v line internally! (neat!)
    display.begin(SSD1306_SWITCHCAPVCC, 0x3C, false); // initialize with the I2C addr 0x3C (for the 128x64)
    // Initialising the UI will init the display too.
    // display.clearDisplay();
    // display.setTextSize(1);
    // display.setTextColor(WHITE);
    // display.setCursor(30, 5);
    // display.print("ESP32 IGATE");
    // display.setCursor(1, 17);
    // display.print("Firmware Version " + String(VERSION));
    // display.drawLine(10, 30, 110, 30, WHITE);
    // display.setCursor(1, 40);
    // display.print("Push B Factory reset");
    // display.display();
    display.clearDisplay();
    display.setTextSize(1);
    display.setTextColor(WHITE);

    display.setTextSize(1);
    display.setFont(&FreeSansBold9pt7b);
    display.setCursor(0, 15);
    display.print("APRS");
    display.setCursor(60, 32);
    display.print("I-GATE");
    display.drawYBitmap(0, 16, LOGO, 48, 48, WHITE);
    display.drawRoundRect(52, 16, 75, 22, 3, WHITE);

    display.setFont();
    display.setTextColor(WHITE);

    display.setCursor(60, 40);
    display.printf("FW Ver %s%c", VERSION, VERSION_BUILD);
    display.setCursor(65, 5);
    display.print("Copy@2022");
    display.display();
#endif

    if (!EEPROM.begin(EEPROM_SIZE))
    {
        Serial.println(F("failed to initialise EEPROM")); // delay(100000);
    }

#ifdef OLED
    delay(1000);
    digitalWrite(LED_TX, HIGH);
    display.fillRect(49, 49, 50, 8, 0);
    display.setCursor(70, 50);
    display.print("3 Sec");
    display.display();
    delay(1000);
    digitalWrite(LED_RX, HIGH);
    display.fillRect(49, 49, 50, 8, 0);
    display.setCursor(70, 50);
    display.print("2 Sec");
    display.display();
    delay(1000);
    display.fillRect(49, 49, 50, 8, 0);
    display.setCursor(70, 50);
    display.print("1 Sec");
    display.display();
    delay(1000);
#else
    delay(1000);
    digitalWrite(LED_TX, HIGH);
    delay(1000);
    digitalWrite(LED_RX, HIGH);
    delay(1000);
#endif
    if (digitalRead(0) == LOW)
    {
        defaultConfig();
        Serial.println("Manual Default configure!");
#ifdef OLED
        display.clearDisplay();
        display.setCursor(10, 22);
        display.print("Factory Reset!");
        display.display();
#endif
        while (digitalRead(0) == LOW)
        {
            delay(500);
            digitalWrite(LED_TX, LOW);
            digitalWrite(LED_RX, LOW);
            delay(500);
            digitalWrite(LED_TX, HIGH);
            digitalWrite(LED_RX, HIGH);
        }
    }
    digitalWrite(LED_TX, LOW);
    digitalWrite(LED_RX, LOW);

    // ตรวจสอบคอนฟิกซ์ผิดพลาด
    ptr = (byte *)&config;
    EEPROM.readBytes(1, ptr, sizeof(Configuration));
    uint8_t chkSum = checkSum(ptr, sizeof(Configuration));
    Serial.printf("EEPROM Check %0Xh=%0Xh(%dByte)\n", EEPROM.read(0), chkSum, sizeof(Configuration));
    if (EEPROM.read(0) != chkSum)
    {
        Serial.println("CFG EEPROM Error!");
        Serial.println("Factory Default");
        defaultConfig();
    }

