nakhonthai/ESP32IGate/src/main.cpp
#ifdef WX

int GetAPRSDataAvg(char *strData)
{
    unsigned int i;

    int lat_dd, lat_mm, lat_ss, lon_dd, lon_mm, lon_ss;
    char strtmp[300], obj[30];

    memset(&obj[0], 0, sizeof(obj));

    DD_DDDDDtoDDMMSS(config.wx_lat, &lat_dd, &lat_mm, &lat_ss);
    DD_DDDDDtoDDMMSS(config.wx_lon, &lon_dd, &lon_mm, &lon_ss);
    if (strlen(config.wx_object) >= 3)
    {
        char object[10];
        memset(object, 0x20, 10);
        memcpy(object, config.wx_object,strlen(config.wx_object));
        object[9] = 0;
        String timeStamp=getTimeStamp();
        sprintf(obj, ";%s*%s", object,timeStamp);
    }
    else
    {
        if(config.wx_timestamp){
            String timeStamp=getTimeStamp();
            sprintf(obj,"/%s",timeStamp.c_str());
        }else{
            sprintf(obj, "!");
            obj[1] = 0;
        }
    }
    if (config.wx_ssid == 0){
        if (config.wx_path[0] != 0)
            sprintf(strtmp, "%s>APE32I,%s:", config.wx_mycall,config.wx_path);
        else
            sprintf(strtmp, "%s>APE32I:", config.wx_mycall);
    }else{
        if (config.wx_path[0] != 0)
            sprintf(strtmp, "%s-%d>APE32I,%s:", config.wx_mycall, config.wx_ssid,config.wx_path);
        else
            sprintf(strtmp, "%s-%d>APE32I:", config.wx_mycall, config.wx_ssid);
    }

    strcat(strData, strtmp);
    strcat(strData, obj);

    sprintf(strtmp, "%02d%02d.%02dN/%03d%02d.%02dE_", lat_dd, lat_mm, lat_ss, lon_dd, lon_mm, lon_ss);
    strcat(strData, strtmp);

    sprintf(strtmp, "%03u/%03ug%03u", weather.winddirection, (unsigned int)(weather.windspeed * 0.621), (unsigned int)(weather.windgust * 0.621));
    strcat(strData, strtmp);

    unsigned int tempF = (unsigned int)((weather.temperature * 9 / 5) + 32);
    sprintf(strtmp, "t%03u", tempF);
    strcat(strData, strtmp);

    unsigned int rain = (unsigned int)((weather.rain * 100.0F) / 25.6F);
    unsigned int rain24 = (unsigned int)((weather.rain24hr * 100.0F) / 25.6F);
    time_t now;
    time(&now);
    struct tm *info = gmtime(&now);
    if (info->tm_min == 0)
    {
        rain = 0;
        weather.rain = 0;
    }
    if (info->tm_hour == 0 && info->tm_min == 0)
    {
        rain24 = 0;
        weather.rain24hr = 0;
    }
    sprintf(strtmp, "r%03up%03uP...", rain, rain24);
    strcat(strData, strtmp);

    if (weather.solar < 1000)
        sprintf(strtmp, "L%03u", (unsigned int)weather.solar);
    else
        sprintf(strtmp, "l%03u", (unsigned int)weather.solar - 1000);
    strcat(strData, strtmp);

    sprintf(strtmp, "h%02u", (unsigned int)weather.humidity);
    strcat(strData, strtmp);

    sprintf(strtmp, "b%05u", (unsigned int)(weather.barometric * 10));
    strcat(strData, strtmp);

    // sprintf(strtmp,"m%03u",(int)((weather.soitemp*9/5)+32));
    // strcat(strData,strtmp);

    // sprintf(strtmp,"M%03u",(unsigned int)(weather.soihum/10));
    // strcat(strData,strtmp);

    // sprintf(strtmp,"W%04u",(unsigned int)(weather.water));
    // strcat(strData,strtmp);

    sprintf(strtmp, " BAT:%0.2fV/%dmA", weather.vbat, (int)(weather.ibat * 1000));
    strcat(strData, strtmp);
    // sprintf(strtmp,"/%0.1fmA",weather.ibat*1000);
    // strcat(strData,strtmp);

    i = strlen(strData);
    return i;
}

bool weatherUpdate = false;
void getWeather()
{
    String stream, weatherRaw;
    int st = 0;
    if (Serial.available() > 30)
    {
        stream = Serial.readString();
        // Serial.println(stream);
        delay(100);
        st = stream.indexOf("DATA:");
        // Serial.printf("Find ModBus > %d",st);
        // Serial.println(stream);
        if (st >= 0)
        {
            // String data = stream.substring(st+5);
            weatherRaw = stream.substring(st + 5);
            weatherUpdate = true;
            // Serial.println("Weather DATA: " + weatherRaw);
        }
        else
        {
            st = stream.indexOf("CLK?");
            if (st >= 0)
            {
                struct tm br_time;
                getLocalTime(&br_time, 5000);
                char strtmp[30];
                Serial.printf(strtmp, "#CLK=%02d/%02d/%02d,%02d:%02d:%02d\r\n", br_time.tm_year - 2000, br_time.tm_mon, br_time.tm_mday, br_time.tm_hour, br_time.tm_min, br_time.tm_sec);
            }
        }

        if (weatherUpdate)
        {
            // String value;
            float rainSample = getValue(weatherRaw, ',', 2).toFloat();
            weather.rain += rainSample;
            weather.rain24hr += rainSample;
            weather.windspeed = getValue(weatherRaw, ',', 3).toFloat();
            weather.winddirection = getValue(weatherRaw, ',', 4).toInt();
            weather.solar = getValue(weatherRaw, ',', 5).toInt();
            weather.barometric = getValue(weatherRaw, ',', 6).toFloat() * 10.0F;
            weather.temperature = getValue(weatherRaw, ',', 7).toFloat();
            weather.humidity = getValue(weatherRaw, ',', 8).toFloat();
            weather.windgust = getValue(weatherRaw, ',', 13).toFloat();
            weather.vbat = getValue(weatherRaw, ',', 9).toFloat();
            weather.vsolar = getValue(weatherRaw, ',', 10).toFloat();
            weather.ibat = getValue(weatherRaw, ',', 11).toFloat();
            weather.pbat = getValue(weatherRaw, ',', 12).toFloat();

            weatherUpdate = false;
            wxTimeout = millis();
            char strData[300];
            size_t lng = GetAPRSDataAvg(strData);

            if (config.wx_2rf)
            { // WX SEND POSITION TO RF
                pkgTxPush(strData, lng, 0);
            }
            if (config.wx_2inet)
            { // WX SEND TO APRS-IS
                if (aprsClient.connected())
                {
                    status.txCount++;
                    aprsClient.println(strData); // Send packet to Inet
                }
            }
            // Serial.printf("APRS: %s\r\n",strData);
        }
        Serial.flush();
    }
    // ModbusSerial.flush();
}
#endif

unsigned long timeSec;
void loop()
{
    vTaskDelay(5 / portTICK_PERIOD_MS);
#ifdef BLUETOOTH
    if (config.bt_master)
        Bluetooth();
#endif

