nakhonthai/ESP32IGate/src/main.cpp
#ifdef WX
    if (config.wx_en)
        getWeather();
#endif

    if (digitalRead(0) == LOW)
    {
        btn_count++;
        if (btn_count > 1000) // Push BOOT 10sec
        {
            digitalWrite(LED_PIN, HIGH);
            digitalWrite(LED_TX_PIN, HIGH);
        }
    }
    else
    {
        if (btn_count > 0)
        {
            // Serial.printf("btn_count=%dms\n", btn_count * 10);
            if (btn_count > 1000) // Push BOOT 10sec to Factory Default
            {
                // digitalWrite(LED_RX, LOW);
                // digitalWrite(LED_TX, LOW);
                defaultConfig();
                Serial.println("SYSTEM REBOOT NOW!");
                esp_restart();
            }
            else
            {
                showDisp = true;
                timeSec = timeHalfSec = millis();
                // if (oledSleepTimeout > 0)
                //{
                curTab++;
                if (curTab > 3)
                    curTab = 0;
                //}
            }
            btn_count = 0;
        }
    }

#ifdef OLED
    // Popup Display
    if (config.oled_enable == true)
    {
        if (dispBuffer.getCount() > 0)
        {
            if (millis() > timeHalfSec)
            {
                char tnc2[300];
                dispBuffer.pop(&tnc2);
                dispWindow(String(tnc2), 0, false);
                timeHalfSec = millis() + (config.dispDelay * 1000);
                oledSleepTimeout = millis() + (config.oled_timeout * 1000);
            }
        }
        else
        {
            // Sleep display
            if (millis() > timeHalfSec)
            {
                if (millis() > timeSec && timeHalfSec > 0)
                {
                    timeSec = millis() + 10000;
                    showDisp = true;
                    // timeHalfSec = 0;
                    // oledSleepTimeout = millis() + (config.oled_timeout * 1000);
                }
                else
                {
                    if (millis() > oledSleepTimeout && oledSleepTimeout > 0)
                    {
                        showDisp = false;
                        timeHalfSec = 0;
                        oledSleepTimeout = 0;
                        display.clearDisplay();
                        display.display();
                    }
                }
            }
        }

        if (showDisp)
        {
            showDisp = false;
            timeHalfSec = millis();
            // oledSleepTimeout = millis() + (config.oled_timeout * 1000);
            switch (curTab)
            {
            case 0:
                statisticsDisp();
                timeSec = millis() + 10000;
                break;
            case 1:
                pkgLastDisp();
                timeSec = millis() + 10000;
                break;
            case 2:
                pkgCountDisp();
                timeSec = millis() + 10000;
                break;
            case 3:
                systemDisp();
                break;
            }
        }
    }
#endif

    // Tick one secound
    if (millis() > timeCheck)
    {
        timeCheck = millis() + 10000;
        if (ESP.getFreeHeap() < 60000)
            esp_restart();
        // Serial.println(String(ESP.getFreeHeap()));
    }
#ifdef SA818
    // if (SerialRF.available())
    // {
    //     Serial.print(Serial.readString());
    // }
#endif
    if (AFSKInitAct == true)
    {
#ifdef SA818
        AFSK_Poll(true, config.rf_power);
#else
        AFSK_Poll(false, LOW);
#endif
    }
}

String sendIsAckMsg(String toCallSign, int msgId)
{
    char str[300];
    char call[11];
    int i;
    memset(&call[0], 0, 11);
    sprintf(call, "%s-%d", config.aprs_mycall, config.aprs_ssid);
    strcpy(&call[0], toCallSign.c_str());
    i = strlen(call);
    for (; i < 9; i++)
        call[i] = 0x20;
    memset(&str[0], 0, 300);

    sprintf(str, "%s-%d>APE32I%s::%s:ack%d", config.aprs_mycall, config.aprs_ssid, VERSION, call, msgId);
    //	client.println(str);
    return String(str);
}

void sendIsPkg(char *raw)
{
    char str[300];
    sprintf(str, "%s-%d>APE32I%s:%s", config.aprs_mycall, config.aprs_ssid, VERSION, raw);
    // client.println(str);
    String tnc2Raw = String(str);
    if (aprsClient.connected())
        aprsClient.println(tnc2Raw); // Send packet to Inet
    if (config.digi_en)
        pkgTxPush(str, strlen(str), 0);
}

void sendIsPkgMsg(char *raw)
{
    char str[300];
    char call[11];
    int i;
    memset(&call[0], 0, 11);
    if (config.aprs_ssid == 0)
        sprintf(call, "%s", config.aprs_mycall);
    else
        sprintf(call, "%s-%d", config.aprs_mycall, config.aprs_ssid);
    i = strlen(call);
    for (; i < 9; i++)
        call[i] = 0x20;

    if (config.aprs_ssid == 0)
        sprintf(str, "%s>APE32I::%s:%s", config.aprs_mycall, call, raw);
    else
        sprintf(str, "%s-%d>APE32I::%s:%s", config.aprs_mycall, config.aprs_ssid, call, raw);

    String tnc2Raw = String(str);
    if (aprsClient.connected())
        aprsClient.println(tnc2Raw); // Send packet to Inet
    // if (config.tnc && config.tnc_digi)
    //     pkgTxUpdate(str, 0);
    // APRS_sendTNC2Pkt(tnc2Raw); // Send packet to RF
}

char EVENT_TX_POSITION = 0;
unsigned char SB_SPEED = 0, SB_SPEED_OLD = 0;
int16_t SB_HEADING = 0;
uint16_t tx_interval = 0, igate_tx_interval, digi_tx_interval; // How often we transmit, in seconds
unsigned int tx_counter, igate_tx_counter, digi_tx_counter;    // Incremented every second
int16_t last_heading, heading_change;                          // Keep track of corner pegging
uint16_t trk_interval = 15;

void GPS_INIT()
{
    SerialGPS.begin(9600, SERIAL_8N1, config.gnss_rx_gpio, config.gnss_tx_gpio);
    SerialGPS.flush();
    while (SerialGPS.available() > 0)
        SerialGPS.read();
}

void taskGPS(void *pvParameters)
{
    unsigned long gpsTickInterval;
    GPS_INIT();
    for (;;)
    {
        vTaskDelay(100 / portTICK_PERIOD_MS);

        while (SerialGPS.available())
            gps.encode(SerialGPS.read());

