nakhonthai/ESP32IGate/src/main.cpp
                    String rawData;
                    if (config.digi_gps)
                    { // DIGI Send GPS position
                        if (gps.location.isValid())
                            rawData = digi_position(gps.location.lat(), gps.location.lng(), gps.altitude.meters(), "");
                    }
                    else
                    { // DIGI Send fix position
                        rawData = digi_position(config.digi_lat, config.digi_lon, config.digi_alt, "");
                    }
                    if (rawData != "")
                    {
                        DiGiInterval = millis() + (config.digi_interval * 1000);
                        log_d("DIGI_POSITION: %s", rawData.c_str());

                        if (config.digi_gps)
                            sprintf(sts, "POSITION GPS\nINTERVAL %ds", tx_interval);
                        else
                            sprintf(sts, "POSITION FIX\nINTERVAL %ds", tx_interval);
                        if (config.digi_loc2rf)
                        { // DIGI SEND POSITION TO RF
                            char *rawP = (char *)malloc(rawData.length());
                            // rawData.toCharArray(rawP, rawData.length());
                            memcpy(rawP, rawData.c_str(), rawData.length());
                            pkgTxPush(rawP, rawData.length(), 0);
                            pushTxDisp(TXCH_RF, "TX DIGI POS", sts);
                            free(rawP);
                        }
                        if (config.digi_loc2inet)
                        { // DIGI SEND TO APRS-IS
                            if (aprsClient.connected())
                            {
                                status.txCount++;
                                aprsClient.println(rawData); // Send packet to Inet
                                pushTxDisp(TXCH_TCP, "TX DIGI POS", sts);
                            }
                        }
                    }
                }
            }

            // Repeater packet
            if (newDigiPkg)
            {
                newDigiPkg = false;
                uint16_t type = pkgType((const char *)&incomingPacket.info[0]);
                // Digi repeater filter
                if ((type & config.digiFilter))
                {
                    // Packet recheck
                    pkgTxDuplicate(incomingPacket); // Search duplicate in tx and drop packet for renew
                    int dlyFlag = digiProcess(incomingPacket);
                    if (dlyFlag > 0)
                    {
                        int digiDelay;
                        status.digiCount++;
                        if (dlyFlag == 1)
                        {
                            digiDelay = 0;
                        }
                        else
                        {
                            if (config.digi_delay == 0)
                            { // Auto mode
                              // if (digiCount > 20)
                              //   digiDelay = random(5000);
                              // else if (digiCount > 10)
                              //   digiDelay = random(3000);
                              // else if (digiCount > 0)
                              //   digiDelay = random(1500);
                              // else
                                digiDelay = random(100);
                            }
                            else
                            {
                                digiDelay = random(config.digi_delay);
                            }
                        }

                        String digiPkg;
                        packet2Raw(digiPkg, incomingPacket);
                        log_d("DIGI_REPEAT: %s", digiPkg.c_str());
                        log_d("DIGI delay=%d ms.", digiDelay);
                        char *rawP = (char *)malloc(digiPkg.length());
                        // digiPkg.toCharArray(rawP, digiPkg.length());
                        memcpy(rawP, digiPkg.c_str(), digiPkg.length());
                        pkgTxPush(rawP, digiPkg.length(), digiDelay);
                        sprintf(sts, "--src call--\n%s\nDelay: %dms.", incomingPacket.src.call, digiDelay);
                        pushTxDisp(TXCH_DIGI, "DIGI REPEAT", sts);
                        free(rawP);
                    }
                }
            }
        }

        // if (config.tnc_telemetry)
        // {
        //     if (igateTLM.TeleTimeout < millis())
        //     {
        //         igateTLM.TeleTimeout = millis() + 600000; // 10Min
        //         if ((igateTLM.Sequence % 6) == 0)
        //         {
        //             sendIsPkgMsg((char *)&PARM[0]);
        //             sendIsPkgMsg((char *)&UNIT[0]);
        //             sendIsPkgMsg((char *)&EQNS[0]);
        //         }
        //         char rawTlm[100];
        //         if (config.aprs_ssid == 0)
        //             sprintf(rawTlm, "%s>APE32I:T#%03d,%d,%d,%d,%d,%d,00000000", config.aprs_mycall, igateTLM.Sequence, igateTLM.RF2INET, igateTLM.INET2RF, igateTLM.RX, igateTLM.TX, igateTLM.DROP);
        //         else
        //             sprintf(rawTlm, "%s-%d>APE32I:T#%03d,%d,%d,%d,%d,%d,00000000", config.aprs_mycall, config.aprs_ssid, igateTLM.Sequence, igateTLM.RF2INET, igateTLM.INET2RF, igateTLM.RX, igateTLM.TX, igateTLM.DROP);

        //         if (aprsClient.connected())
        //             aprsClient.println(String(rawTlm)); // Send packet to Inet
        //         if (config.tnc && config.tnc_digi)
        //             pkgTxUpdate(rawTlm, 0);
        //         // APRS_sendTNC2Pkt(String(rawTlm)); // Send packet to RF
        //         igateTLM.Sequence++;
        //         if (igateTLM.Sequence > 999)
        //             igateTLM.Sequence = 0;
        //         igateTLM.DROP = 0;
        //         igateTLM.INET2RF = 0;
        //         igateTLM.RF2INET = 0;
        //         igateTLM.RX = 0;
        //         igateTLM.TX = 0;
        //         // client.println(raw);
        //     }
        // }
    }
}

int mqttRetry = 0;
long wifiTTL = 0;
WiFiMulti wifiMulti;

// WiFi connect timeout per AP. Increase when connecting takes longer.
const uint32_t connectTimeoutMs = 10000;

void taskNetwork(void *pvParameters)
{
    int c = 0;
    log_d("Task Network has been start");

    // WiFi.onEvent(Wifi_connected,SYSTEM_EVENT_STA_CONNECTED);
    // WiFi.onEvent(Get_IPAddress, SYSTEM_EVENT_STA_GOT_IP);
    // WiFi.onEvent(Wifi_disconnected, SYSTEM_EVENT_STA_DISCONNECTED);

    if (config.wifi_mode == WIFI_STA_FIX)
    { /**< WiFi station mode */
        WiFi.mode(WIFI_MODE_STA);
    }
    else if (config.wifi_mode == WIFI_AP_FIX)
    { /**< WiFi soft-AP mode */
        WiFi.mode(WIFI_MODE_AP);
    }
    if (config.wifi_mode == WIFI_AP_STA_FIX)
    { /**< WiFi station + soft-AP mode */
        WiFi.mode(WIFI_MODE_APSTA);
    }
    else
    {
        WiFi.mode(WIFI_MODE_NULL);
    }

    if (config.wifi_mode & WIFI_STA_FIX)
    {
        for (int i = 0; i < 5; i++)
        {
            if (config.wifi_sta[i].enable)
            {
                wifiMulti.addAP(config.wifi_sta[i].wifi_ssid, config.wifi_sta[i].wifi_pass);
            }
        }
        WiFi.setTxPower((wifi_power_t)config.wifi_power);
        WiFi.setHostname("ESP32IGate");
    }

