nakhonthai/ESP32IGate/src/main.cpp
    if (config.wifi_mode & WIFI_AP_FIX)
    {
        // กำหนดค่าการทำงานไวไฟเป็นแอสเซสพ้อย
        WiFi.softAP(config.wifi_ap_ssid, config.wifi_ap_pass); // Start HOTspot removing password will disable security
        WiFi.softAPConfig(local_IP, gateway, subnet);
        Serial.print("Access point running. IP address: ");
        Serial.print(WiFi.softAPIP());
        Serial.println("");
        webService();
    }

    if (wifiMulti.run() == WL_CONNECTED)
    {
        // Serial.println("");
        log_d("Wi-Fi CONNECTED!");
        log_d("IP address: %s", WiFi.localIP().toString().c_str());
        NTP_Timeout = millis() + 2000;
    }

    pingTimeout = millis() + 10000;
    unsigned long timeNetworkOld = millis();
    timeNetwork = 0;
    for (;;)
    {
        unsigned long now = millis();
        timeNetwork = now - timeNetworkOld;
        timeNetworkOld = now;
        // wdtNetworkTimer = millis();
        vTaskDelay(1 / portTICK_PERIOD_MS);
        // if (WiFi.status() == WL_CONNECTED)
        if (wifiMulti.run(connectTimeoutMs) == WL_CONNECTED)
        {
            webService();
            serviceHandle();

            if (millis() > NTP_Timeout)
            {
                NTP_Timeout = millis() + 86400000;
                // Serial.println("Config NTP");
                // setSyncProvider(getNtpTime);
                log_d("Contacting Time Server\n");
                configTime(3600 * config.timeZone, 0, config.ntp_host);
                vTaskDelay(1000 / portTICK_PERIOD_MS);
                time_t systemTime;
                time(&systemTime);
                setTime(systemTime);
                if (systemUptime == 0)
                {
                    systemUptime = time(NULL);
                }
                pingTimeout = millis() + 2000;
                if (config.vpn)
                {
                    if (!wireguard_active())
                    {
                        log_d("Setup Wiregurad VPN!");
                        wireguard_setup();
                    }
                }
            }

            if (config.igate_en)
            {
                if (aprsClient.connected() == false)
                {
                    APRSConnect();
                    if (config.igate_bcn)
                    {
                        iGatetickInterval = millis() + 10000; // send position after 10sec
                    }
                }
                else
                {
                    if (aprsClient.available())
                    {
                        pingTimeout = millis() + 300000;                // Reset ping timout
                        String line = aprsClient.readStringUntil('\n'); // อ่านค่าที่ Server ตอบหลับมาทีละบรรทัด
#ifdef DEBUG_IS
                        printTime();
                        Serial.print("APRS-IS ");
                        Serial.println(line);
#endif
                        status.isCount++;
                        int start_val = line.indexOf(">", 0); // หาตำแหน่งแรกของ >
                        if (start_val > 3)
                        {
                            String src_call = line.substring(0, start_val);
                            String msg_call = "::" + src_call;

                            status.allCount++;
                            status.rxCount++;
                            igateTLM.RX++;

                            log_d("INET: %s\n", line.c_str());
                            char raw[500];
                            memset(&raw[0], 0, sizeof(raw));
                            start_val = line.indexOf(":", 10); // Search of info in ax25
                            if (start_val > 5)
                            {
                                String info = line.substring(start_val + 1);
                                // info.toCharArray(&raw[0], info.length(), 0);
                                memcpy(raw, info.c_str(), info.length());

                                uint16_t type = pkgType(&raw[0]);
                                int start_dstssid = line.indexOf("-", 1); // get SSID -
                                if (start_dstssid < 0)
                                    start_dstssid = line.indexOf(" ", 1); // get ssid space
                                char ssid = 0;
                                if (start_dstssid > 0)
                                    ssid = line.charAt(start_dstssid + 1);

                                if (ssid > 47 && ssid < 58)
                                {
                                    size_t len = src_call.length();
                                    char call[15];
                                    memset(call, 0, sizeof(call));
                                    if (len > 15)
                                        len = 15;
                                    memcpy(call, src_call.c_str(), len);
                                    call[14] = 0;
                                    memset(raw, 0, sizeof(raw));
                                    memcpy(raw, line.c_str(), line.length());
                                    raw[sizeof(raw) - 1] = 0;
                                    int idx = pkgListUpdate(call, raw, type, 1);
                                    int cnt = 0;
#ifdef OLED
                                    if (idx > -1)
                                    {
                                        // Put queue affter filter for display popup
                                        if (config.rx_display && config.dispINET && (type & config.dispFilter))
                                        {
                                            dispBuffer.push(line.c_str());
                                            log_d("INET_putQueueDisp:[pkgList_idx=%d/queue=%d,Type=%d] %s\n", idx, dispBuffer.getCount(), type, call);
                                        }
                                    }
#endif
                                    // INET2RF affter filter
                                    if (config.inet2rf)
                                    {
                                        if (type & config.inet2rfFilter)
                                        {
                                            char strtmp[300];
                                            String tnc2Raw = "";
                                            if (config.aprs_ssid == 0)
                                                sprintf(strtmp, "%s>APE32I", config.aprs_mycall);
                                            else
                                                sprintf(strtmp, "%s-%d>APE32I", config.aprs_mycall, config.aprs_ssid);
                                            tnc2Raw = String(strtmp);
                                            tnc2Raw += ",RFONLY"; // fix path to rf only not send loop to inet
                                            tnc2Raw += ":}";      // 3rd-party frame
                                            tnc2Raw += line;
                                            pkgTxPush(tnc2Raw.c_str(), tnc2Raw.length(), 0);
                                            char sts[50];
                                            sprintf(sts, "--SRC CALL--\n%s\n", src_call.c_str());
                                            pushTxDisp(TXCH_3PTY, "TX INET->RF", sts);
                                            status.inet2rf++;
                                            igateTLM.INET2RF++;
                                            log_d("INET2RF: %s\n", line);
                                        }
                                    }
                                }
                            }
                        }
                        // free(raw);
                    }
                }
            }

